app/controllers/customers_controller.rb

INSERT INTO "customers" ("address_city", "address_state", "address_street", "created_at", "email", "image", "name_company", "name_first", "name_last", "phone", "postal_code", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "customers" SET "name_first" = 'Dennis', "name_last" = 'Keefe', "email" = 'dkeefe55@gmail.com', "address_street" = '26 Seventh Ave', "address_state" = 'Massachusetts', "postal_code" = '01863', "phone" = '9782513373', "updated_at" = '2012-10-20 23:53:47.020858' WHERE "customers"."id" = 1
---
  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])